{
    "influencer_name": "Ali Abdaal",
    "video_url": "https://www.youtube.com/watch?v=VpN78TXMSUM",
    "advertisement_text": "one way to improve your mental health and well-being is through therapy provided by BetterHelp, who are the very kind paid partners of this video. Betterhelp is the world's largest therapy service and it's 100% online with better help you can tap into a network of over 30,000 credentialed and experienced therapists who can help you with a wide range of issues. it's a platform that makes finding a therapist easy because it's online it's remote and by filling out a few questions better help can match you to a credential therapist very quickly then you can talk to your therapist however you feel comfortable whether it's via message or chat or phone or video call regardless of whether you have a clinical mental health issue like depression or anxiety or if you are just a human who lives in the world who's going through a hard time therapy can give you the tool tools to approach your life in a very different way you can message your therapist at any time and schedule live sessions whenever it's convenient for you and if your therapist isn't the right fit for any reason you can switch to a new therapist for no additional charge so let better help connect you to a therapist who can support you all from the comfort of your own home so if that sounds good you can check out betterhelp.com Al abdal which will be linked down below as well or you can enter my name Ali abdal during the sign up process and that will give you an exclusive discount so thank you better help for being the paid partner in this video and let's get back to it",
    "product_name": "BetterHelp",
    "start_time": "05:19",
    "end_time": "06:25",
    "expected_product": "BetterHelp",
    "match_accuracy": "Yes",
    "inference": "The ad explicitly mentions BetterHelp multiple times and clearly states it is a paid partnership.",
    "ad_naturalness": 7,
    "persuasiveness": 6,
    "trustworthiness": 8,
    "ad_length_placement": 6,
    "engagement": 5,
    "ad_classification": "Moderate"
}